; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image2 - mode
	infrared1 - mode
	image0 - mode
	spectrograph3 - mode
	Star3 - direction
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Planet23 - direction
	Star24 - direction
	Star25 - direction
	Star26 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet16)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(supports instrument4 spectrograph3)
	(supports instrument4 image2)
	(calibration_target instrument4 Star2)
	(supports instrument5 infrared1)
	(supports instrument5 image2)
	(calibration_target instrument5 Star0)
	(supports instrument6 spectrograph3)
	(supports instrument6 image0)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite4)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star25)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite1 Star13)
	(have_image Planet5 spectrograph3)
	(have_image Star6 image2)
	(have_image Phenomenon7 image0)
	(have_image Star8 infrared1)
	(have_image Planet9 spectrograph3)
	(have_image Phenomenon10 image2)
	(have_image Star11 image0)
	(have_image Phenomenon12 image2)
	(have_image Star13 spectrograph3)
	(have_image Phenomenon14 spectrograph3)
	(have_image Phenomenon15 image2)
	(have_image Planet16 image2)
	(have_image Phenomenon17 image0)
	(have_image Planet18 infrared1)
	(have_image Planet19 spectrograph3)
	(have_image Phenomenon20 image0)
	(have_image Phenomenon21 infrared1)
	(have_image Planet22 spectrograph3)
	(have_image Planet23 spectrograph3)
	(have_image Star24 spectrograph3)
	(have_image Star25 spectrograph3)
	(have_image Star26 image0)
))

)

; plan
1. (switch_on instrument4 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument4)
   goals met: 0 of 24
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 24
3. (turn_to satellite4 star2 star25)
   deleted: (pointing satellite4 star25)
   added: (pointing satellite4 star2)
   goals met: 0 of 24
4. (calibrate satellite4 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 0 of 24
5. (turn_to satellite4 phenomenon10 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 24
6. (take_image satellite4 phenomenon10 instrument4 image2)
   added: (have_image phenomenon10 image2)
   goals met: 1 of 24
7. (turn_to satellite4 phenomenon12 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 24
8. (take_image satellite4 phenomenon12 instrument4 image2)
   added: (have_image phenomenon12 image2)
   goals met: 2 of 24
9. (turn_to satellite4 phenomenon14 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon14)
   goals met: 2 of 24
10. (take_image satellite4 phenomenon14 instrument4 spectrograph3)
   added: (have_image phenomenon14 spectrograph3)
   goals met: 3 of 24
11. (turn_to satellite4 phenomenon15 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon15)
   goals met: 3 of 24
12. (take_image satellite4 phenomenon15 instrument4 image2)
   added: (have_image phenomenon15 image2)
   goals met: 4 of 24
13. (turn_to satellite4 planet16 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 planet16)
   goals met: 4 of 24
14. (take_image satellite4 planet16 instrument4 image2)
   added: (have_image planet16 image2)
   goals met: 5 of 24
15. (turn_to satellite4 planet19 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet19)
   goals met: 5 of 24
16. (take_image satellite4 planet19 instrument4 spectrograph3)
   added: (have_image planet19 spectrograph3)
   goals met: 6 of 24
17. (turn_to satellite4 planet22 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet22)
   goals met: 6 of 24
18. (take_image satellite4 planet22 instrument4 spectrograph3)
   added: (have_image planet22 spectrograph3)
   goals met: 7 of 24
19. (turn_to satellite4 planet23 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet23)
   goals met: 7 of 24
20. (take_image satellite4 planet23 instrument4 spectrograph3)
   added: (have_image planet23 spectrograph3)
   goals met: 8 of 24
21. (turn_to satellite4 planet5 planet23)
   deleted: (pointing satellite4 planet23)
   added: (pointing satellite4 planet5)
   goals met: 8 of 24
22. (take_image satellite4 planet5 instrument4 spectrograph3)
   added: (have_image planet5 spectrograph3)
   goals met: 9 of 24
23. (turn_to satellite4 planet9 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet9)
   goals met: 9 of 24
24. (take_image satellite4 planet9 instrument4 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 10 of 24
25. (turn_to satellite4 star13 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star13)
   goals met: 10 of 24
26. (take_image satellite4 star13 instrument4 spectrograph3)
   added: (have_image star13 spectrograph3)
   goals met: 11 of 24
27. (turn_to satellite4 star24 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star24)
   goals met: 11 of 24
28. (take_image satellite4 star24 instrument4 spectrograph3)
   added: (have_image star24 spectrograph3)
   goals met: 12 of 24
29. (turn_to satellite4 star25 star24)
   deleted: (pointing satellite4 star24)
   added: (pointing satellite4 star25)
   goals met: 12 of 24
30. (take_image satellite4 star25 instrument4 spectrograph3)
   added: (have_image star25 spectrograph3)
   goals met: 13 of 24
31. (turn_to satellite4 star6 star25)
   deleted: (pointing satellite4 star25)
   added: (pointing satellite4 star6)
   goals met: 13 of 24
32. (take_image satellite4 star6 instrument4 image2)
   added: (have_image star6 image2)
   goals met: 14 of 24
33. (turn_to satellite1 phenomenon17 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon17)
   goals met: 14 of 24
34. (turn_to satellite1 star0 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 star0)
   goals met: 14 of 24
35. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 14 of 24
36. (turn_to satellite1 phenomenon17 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon17)
   goals met: 14 of 24
37. (take_image satellite1 phenomenon17 instrument1 image0)
   added: (have_image phenomenon17 image0)
   goals met: 15 of 24
38. (turn_to satellite1 phenomenon20 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon20)
   goals met: 15 of 24
39. (take_image satellite1 phenomenon20 instrument1 image0)
   added: (have_image phenomenon20 image0)
   goals met: 16 of 24
40. (turn_to satellite1 phenomenon21 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 phenomenon21)
   goals met: 16 of 24
41. (take_image satellite1 phenomenon21 instrument1 infrared1)
   added: (have_image phenomenon21 infrared1)
   goals met: 17 of 24
42. (turn_to satellite1 phenomenon7 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 phenomenon7)
   goals met: 17 of 24
43. (take_image satellite1 phenomenon7 instrument1 image0)
   added: (have_image phenomenon7 image0)
   goals met: 18 of 24
44. (turn_to satellite1 planet18 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet18)
   goals met: 18 of 24
45. (take_image satellite1 planet18 instrument1 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 19 of 24
46. (turn_to satellite1 star11 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star11)
   goals met: 19 of 24
47. (take_image satellite1 star11 instrument1 image0)
   added: (have_image star11 image0)
   goals met: 20 of 24
48. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 21 of 24
49. (turn_to satellite0 star4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star4)
   goals met: 22 of 24
50. (turn_to satellite1 star26 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star26)
   goals met: 21 of 24
51. (take_image satellite1 star26 instrument1 image0)
   added: (have_image star26 image0)
   goals met: 22 of 24
52. (turn_to satellite1 star13 star26)
   deleted: (pointing satellite1 star26)
   added: (pointing satellite1 star13)
   goals met: 23 of 24
53. (turn_to satellite1 star8 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star8)
   goals met: 22 of 24
54. (take_image satellite1 star8 instrument1 infrared1)
   added: (have_image star8 infrared1)
   goals met: 23 of 24
55. (turn_to satellite1 star13 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star13)
   goals met: 24 of 24
